app/Models/ArticleModel.php

SELECT *
FROM `article`
ORDER BY `id_article` DESC
---
    public function getDataArticles()
    {
        return $this->builder->orderBy('id_article', 'DESC')->get()->getResultArray();

SELECT `article`.`id_article`, `article`.`title`, `article`.`image`, `article`.`content`, `article`.`publication_date`, `article`.`view`, `tbl_users`.`name`
FROM `article`
JOIN `tbl_users` ON `tbl_users`.`id_user` = `article`.`id_user`
WHERE `article`.`approved` = '1'
AND `article`.`id_article` = '49'
---
    public function getDataArticleById2($id)
    {
        $this->builder->select('article.id_article, article.title, article.image, article.content, article.publication_date, tbl_users.name, tbl_users.image as user_image');
        $this->builder->join('tbl_users', 'tbl_users.id_user = article.id_user');
        $this->builder->where('article.approved', '1');

SELECT *
FROM `article`
WHERE `approved` = '1'
ORDER BY `id_article` DESC
 LIMIT 8
---
    public function getDataSomeArticles() {
        $this->builder->limit(8);
        $this->builder->where('approved', '1');
        return $this->builder->orderBy('id_article', 'DESC')->get()->getResultArray();

SELECT `title`
FROM `article`
---
    public function getRandomArticleTitle()
    {
        $this->builder->select('title');
        return $this->builder->get()->getResultArray();