app/Models/CategoryModel.php

    public function getDataCategories($id_category = false)
    {
        if ($id_category === false) {
            return $this->builder->orderBy('id_category', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `categories`
ORDER BY `id_category` DESC