app/Models/CommentModel.php

    public function getDataCommentsByArticleId($id_article)
    {
        $this->builder->select('comments.id_comment, comments.id_user, comments.id_article, comments.comment, comments.comment_date, tbl_users.name');
        $this->builder->join('tbl_users', 'tbl_users.id_user = comments.id_user');
        return $this->builder->orderBy('comments.id_comment', 'DESC')->where('comments.id_article', $id_article)->get()->getResultArray();
---
SELECT `comments`.`id_comment`, `comments`.`id_user`, `comments`.`id_article`, `comments`.`comment`, `comments`.`comment_date`, `tbl_users`.`name`
FROM `comments`
JOIN `tbl_users` ON `tbl_users`.`id_user` = `comments`.`id_user`
WHERE `comments`.`id_article` = '37'
ORDER BY `comments`.`id_comment` DESC