app/Models/UserModel.php

    public function getDataUsers($username = false)
    {
        if ($username === false) {
            return $this->builder->orderBy('id_user', 'DESC')->get()->getResultArray();
        }
        return $this->builder->where('username', $username)->get()->getResultArray();
---
SELECT *
FROM `tbl_users`
WHERE `username` = 'admin'

    public function CountUserByRole()
    {
        $this->builder->select('role, COUNT(role) as total');
        $this->builder->groupBy('role');
        return $this->builder->get()->getResultArray();
---
SELECT `role`, COUNT(role) as total
FROM `tbl_users`
GROUP BY `role`